# this code is used to generate audio mp3 files for the text provided in the text_file arr
# the audio mp3 files are stored in the same folder

#use the below language codes
#language codes - Available in 50+ languages
  # af: Afrikaans
  # ar: Arabic
  # bn: Bengali
  # bs: Bosnian
  # ca: Catalan
  # cs: Czech
  # cy: Welsh
  # da: Danish
  # de: German
  # el: Greek
  # en-au: English (Australia)
  # en-ca: English (Canada)
  # en-gb: English (UK)
  # en-gh: English (Ghana)
  # en-ie: English (Ireland)
  # en-in: English (India)
  # en-ng: English (Nigeria)
  # en-nz: English (New Zealand)
  # en-ph: English (Philippines)
  # en-tz: English (Tanzania)
  # en-uk: English (UK)
  # en-us: English (US)
  # en-za: English (South Africa)
  # en: English
  # eo: Esperanto
  # es-es: Spanish (Spain)
  # es-us: Spanish (United States)
  # es: Spanish
  # et: Estonian
  # fi: Finnish
  # fr-ca: French (Canada)
  # fr-fr: French (France)
  # fr: French
  # gu: Gujarati
  # hi: Hindi
  # hr: Croatian
  # hu: Hungarian
  # hy: Armenian
  # id: Indonesian
  # is: Icelandic
  # it: Italian
  # ja: Japanese
  # jw: Javanese
  # km: Khmer
  # kn: Kannada
  # ko: Korean
  # la: Latin
  # lv: Latvian
  # mk: Macedonian
  # ml: Malayalam
  # mr: Marathi
  # my: Myanmar (Burmese)
  # ne: Nepali
  # nl: Dutch
  # no: Norwegian
  # pl: Polish
  # pt-br: Portuguese (Brazil)
  # pt-pt: Portuguese (Portugal)
  # pt: Portuguese
  # ro: Romanian
  # ru: Russian
  # si: Sinhala
  # sk: Slovak
  # sq: Albanian
  # sr: Serbian
  # su: Sundanese
  # sv: Swedish
  # sw: Swahili
  # ta: Tamil
  # te: Telugu
  # th: Thai
  # tl: Filipino
  # tr: Turkish
  # uk: Ukrainian
  # ur: Urdu
  # vi: Vietnamese
  # zh-cn: Chinese (Mandarin/China)
  # zh-tw: Chinese (Mandarin/Taiwan)


import os
import gtts
from time import sleep
import socket
socket.gethostbyname("")

# provide the examples from the sheet
texts=[
        'मैं एक डॉक्टर हूँ। मैं वियतनामी बात नहीं करते। मैं आप इस वेबसाइट का उपयोग कर के साथ संवाद करेंगे। संभव के रूप में ज्यादा के रूप में अंग्रेजी में मुझे उत्तर दो। धन्यवाद।',
        'तुम्हारा नाम क्या है?',
        'मुझे दे कृपया अपने Identitification कार्ड / कार्य परमिट',
        'पिछले 14 दिनों में, आप किसी को जो कोरोना है मिले थे?',
        'Who? उन लोगों के साथ क्या संबंध है?',
        'आप उन्हें कितने दिन पहले मिले थे? (वहाँ साइडबार अगर वे उत्तर नहीं दे सकता में एक नंबर चार्ट है)',
        'कब तक उसे / उसके साथ थी?',
        'पिछले 14 दिनों में, आप सिंगापुर में यात्रा करते रहते किया था? यदि हां, तो हमें अंग्रेजी में देशों बताओ।',
        'क्या आप को बुखार है?',
        '"कितने दिन?',
        '(आप एक से अधिक लक्षण के लिए इसका उपयोग कर सकते)"',
        'आप इसे एक थर्मामीटर के साथ मापने की थी? तुमने किया था, तो उच्चतम पढ़ने क्या था?',
        'बहती नाक?',
        'खांसी?',
        'गले में खरास?',
        'सांस लेने मे तकलीफ?',
        'आप दस्त है? दिन मे कितने बार?',
        'जल्दबाज?',
        'कोई दर्द? विशेष रूप से, किसी भी सीने में दर्द?',
        'जगह पर इंगित करें।',
        'आप किसी भी पिछले चिकित्सा के इतिहास है?',
        'कृपया कौन सा इशारा करते हैं।',
        'दम ',
        'न्यूमोनिया',
        'उच्च रक्तचाप',
        'हाइपरलिपीडेमिया',
        'मधुमेह',
        'हृदय की समस्याएं',
        'गुर्दे से संबंधित समस्याएं',
        'स्वाद का नुकसान',
        'गंध की खोया',
        'आप एक दवा एलर्जी है?',
        'क्या आप धूम्रपान करते हैं? अगर हां, तो कितने सिगरेट एक दिन?',
        'क्या आप पीते हैं? यदि हां, तो कितना (बोतलों की संख्या एक सप्ताह, शराब के प्रकार के)?',
        'आप किसी भी अन्य समस्या है, तो आप मुझे अंग्रेजी में बता सकते हैं।',
        'मैं तुम्हें जांच करने के लिए जा रहा हूँ।',
        'मुझे बताओ कि यदि आप और अधिक दर्द महसूस होता है।',
        'अपनी शर्ट निकाल दें।',
        'अपने मुंह के माध्यम से गहरी साँस लेते रहें।',
        '"99" कहते हैं कि जब मैं अपने स्टेथोस्कोप से सुन।',
        'मैं अपने नथुने में इस कपास कली डाल करने के लिए जा रहा हूँ। आप अजीब महसूस होगा, लेकिन यह दर्दनाक नहीं है',
        'यह कोरोना के लिए परीक्षण करने के लिए है',
        'अपने सिर को पीछे झुकाएं',
        'कोरोना सकारात्मक है, तो हम कल तक अपने फोन को कहते हैं।',
        'कोरोना नकारात्मक, तो हम आपको एसएमएस (पाठ) 3 दिन के बाद भेज',
        'बाद में, आप एक एक्स-रे करना होगा',
        'आपके एक्स-रे पर संक्रमण का कोई संकेत नहीं है',
        'आप जल्द ही वापस जा सकते हैं।',
        'यहाँ रुको, इस क्षेत्र मत छोड़ो',
        'आप कुछ दिनों के लिए अस्पताल में रहना है',
        'हम किसी अन्य स्थान पर आप ट्रांसफर करने होंगे।',
        'मैं तुम्हें दवा आप बेहतर महसूस करने के लिए दे देंगे',
        'आप अगले 5 दिनों के लिए काम नहीं करना चाहिए।',
        'यदि आप श्वास के साथ समस्या है वापस आना चाहिए।',
        'आप वापस आ जाओ अगर आप 5 दिनों के बाद पूरी तरह से ठीक नहीं करना चाहिए',
        'हैंडआउट को ध्यान से पढ़ें',
        'धन्यवाद',
        'सुप्रभात / दोपहर / शाम',
        'मैं नर्स हूँ',
        'मैं एक डॉक्टर हूं',
        'आप गहन चिकित्सा कक्ष में हैं।',
        'आज सोमवार है',
        'आज मंगलवार है',
        'आज बुधवार है',
        'आज गुरूवार है',
        'आज शुक्रवार है',
        'आज शनिवार है',
        'आज रविवार है',
        'तुम ठीक हो रहे हो',
        'जब आप बेहतर कर रहे हैं हम श्वास नली निकाल देंगे',
        'आप हम श्वास नली को दूर करने के बाद बात कर सकते हैं',
        'एक गहरी सास लो',
        'मुझे एक बड़ा खांसी दें',
        'संघर्ष मत करो',
        'हिलने नहीं दें',
        'अपने हाथ उठाकर',
        'अपने पैर उठाकर',
        'मेरे हाथ निचोड़',
        'मुझे दो उंगलियों दिखाएँ',
        'अपना मुहँ खोलो',
        'अपनी जीभ बाहर निकालना',
        'अपनी आँखें खोलो',
        'मैं अपने आँखों में प्रकाश डालने के लिए जा रहा हूँ। यह उज्ज्वल हो जाएगा।',
        'आपके फेफड़े कमजोर हैं। हम आपको साँस लेने में मदद करने के लिए एक श्वास नली डालने के लिए जा रहे हैं',
        'आप सोने के लिए अब जा रहे हैं',
        'हम मदद करने के लिए आपके फेफड़ों का विस्तार अपने पेट पर आप बदल रहे हैं',
        'हम मदद करने के लिए एक ट्यूब डालने कर रहे हैं आप मूत्र त्याग',
        'हम अपनी नाक के माध्यम से एक ट्यूब डालने कर रहे हैं',
        'हम अपनी गर्दन आप दवाओं देने के लिए आप एक इंजेक्शन देने जा रहे हैं',
        'हम अपने रक्तचाप को मापने के लिए अपने हाथ में आप एक इंजेक्शन देने जा रहे हैं',
        'हम आप सो दवाएं दे देंगे।',
        'हम आपको दर्द निवारक दे देंगे।',
        'हम आपको अपने रक्तचाप को बनाए रखने के लिए दवा दे रहे हैं।',
        'हम श्वास नली को दूर करने के लिए जा रहे हैं।',
        'हम आपके कफ बाहर चूसना करने के लिए जा रहे हैं',
        'हम एक स्पंज के साथ आप साफ करने के लिए जा रहे हैं',
        'बाएँ मुड़ें',
        'दायें मुड़ो',
        'हम अपने डायपर बदल जाएगा',
        'अपने पैर उठाकर',
        'हम आपको बैठने जा रहे हैं',
        'हम आपको बिस्तर तक शिफ्ट करने के लिए जा रहे हैं',
        'हम अपना मुँह साफ करने के लिए जा रहे हैं',
        'कुल्ला निगल न करें',
        'क्या आपको दर्द हो रहा है?',
        'दर्द कहाँ है?',
        'यह हल्का, मध्यम या गंभीर है?',
        'आप दर्द को इंगित कर सकते हैं?',
        'सिर',
        'आंखें',
        'कान',
        'नाक',
        'मुंह',
        'गला',
        'छाती',
        'पेट',
        'वापस',
        'हथियारों',
        'पैर',
        'पैर का पंजा',
        '1 एक',
        '2 - दो',
        '3 - तीन',
        '4 - चार',
        '5 - पाँच',
        '6 - छह',
        '7 - सात',
        '8 - आठ',
        '9 - नौ',
        '10 - दस',
        '0 - शून्य',
        'जनवरी',
        'फ़रवरी',
        'मार्च',
        'अप्रैल',
        'मई',
        'जून',
        'जुलाई',
        'अगस्त''सितंबर',
        'अक्टूबर',
        'नवंबर',
        'दिसंबर'
]

lang = "hi" #copy the language code from above documentation

for i in range(len(texts)):
    tts = gtts.gTTS(texts[i], lang=lang,tld="com")
    tts.save(str(i+1)+".mp3")
    # sleep(6)
